; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v10 ?v1)
             (pred_9 ?v13 ?v4)
             (pred_2 ?v10 ?v4)
             (pred_10 ?v6 ?v10 )
	     (pred_11 ?v10)
             (pred_8 ?v2)
             (pred_4 ?v13)
             (pred_6 ?v4)
             (pred_3 ?v10)
             (pred_7 ?v13)
             (pred_12 ?v10)
             (pred_1 ))



(:action op_3
:parameters (?v11 ?v3 ?v9 ?v12)
:precondition (and (pred_8 ?v11) (pred_8 ?v3) (pred_4 ?v9) (pred_6 ?v12)
          (pred_5 ?v11 ?v3) (pred_9 ?v9 ?v12)
                   (pred_2 ?v3 ?v12) (pred_11 ?v11) 
                   (pred_3 ?v3) (pred_7 ?v9))
:effect (and  (pred_12 ?v3) (not (pred_3 ?v3))))


(:action op_5
:parameters (?v11 ?v8)
:precondition (and (pred_8 ?v11) (pred_8 ?v8)
               (pred_11 ?v11) (pred_5 ?v11 ?v8) (pred_12 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v11))))

(:action op_1
:parameters (?v11 ?v9)
:precondition (and (pred_8 ?v11) (pred_4 ?v9) 
                  (pred_11 ?v11) (pred_10 ?v9 ?v11) (pred_1 ))
:effect (and (pred_7 ?v9)
   (not (pred_10 ?v9 ?v11)) (not (pred_1 ))))


(:action op_4
:parameters (?v11 ?v5 ?v7)
:precondition (and (pred_8 ?v11) (pred_4 ?v5) (pred_4 ?v7)
                  (pred_11 ?v11) (pred_7 ?v7) (pred_10 ?v5 ?v11))
:effect (and (pred_7 ?v5) (pred_10 ?v7 ?v11)
        (not (pred_7 ?v7)) (not (pred_10 ?v5 ?v11))))

(:action op_2
:parameters (?v11 ?v9)
:precondition (and (pred_8 ?v11) (pred_4 ?v9) 
                  (pred_11 ?v11) (pred_7 ?v9))
:effect (and (pred_1 ) (pred_10 ?v9 ?v11) (not (pred_7 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_18 obj_13 obj_16 obj_03 obj_07 obj_02 obj_21 obj_01 obj_10 obj_20 obj_05 obj_22 obj_15 obj_17 obj_09
    obj_04 obj_14 obj_08
    obj_11 obj_12 obj_06
    )

    (:init
       (pred_1)

       (pred_8 obj_19)
       (pred_8 obj_18)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_02)
       (pred_8 obj_21)
       (pred_8 obj_01)
       (pred_8 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_05)
       (pred_8 obj_22)
       (pred_8 obj_15)
       (pred_8 obj_17)
       (pred_8 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_14)
       (pred_6 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_12)
       (pred_4 obj_06)

       (pred_5 obj_19 obj_03)
       (pred_5 obj_19 obj_18)
       (pred_5 obj_18 obj_07)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_18 obj_19)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_18)
       (pred_5 obj_16 obj_21)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_03 obj_19)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_18)
       (pred_5 obj_07 obj_03)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_21 obj_05)
       (pred_5 obj_21 obj_16)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_01 obj_22)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_10 obj_20)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_05)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_10)
       (pred_5 obj_05 obj_09)
       (pred_5 obj_05 obj_21)
       (pred_5 obj_05 obj_20)
       (pred_5 obj_22 obj_15)
       (pred_5 obj_22 obj_01)
       (pred_5 obj_15 obj_17)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_22)
       (pred_5 obj_17 obj_09)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_17 obj_15)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_09 obj_17)
       (pred_3 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_2  obj_03 obj_04)
       (pred_2  obj_01 obj_14)
       (pred_2  obj_21 obj_08)
       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_12 obj_13)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_05)
       (pred_12 obj_22)
       (pred_12 obj_15)
       (pred_12 obj_17)
       (pred_12 obj_09)

       (pred_9  obj_11 obj_04)
       (pred_9  obj_12 obj_14)
       (pred_9  obj_06 obj_08)
       (pred_10 obj_11 obj_05)
       (pred_10 obj_12 obj_17)
       (pred_10 obj_06 obj_22)
       (pred_11 obj_13)
    )

    (:goal (and
       (pred_10 obj_12 obj_18)
    ))
(:constraints
  (always (not (pred_11 obj_20)))
)
)

; plan
1. (op_5 obj_13 obj_18)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_18)
   goals met: 0 of 1
2. (op_5 obj_18 obj_07)
   deleted: (pred_11 obj_18)
   added: (pred_11 obj_07)
   goals met: 0 of 1
3. (op_5 obj_07 obj_10)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_15)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_15)
   goals met: 0 of 1
5. (op_5 obj_15 obj_17)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_17)
   goals met: 0 of 1
6. (op_1 obj_17 obj_12)
   deleted: (pred_10 obj_12 obj_17) (pred_1)
   added: (pred_7 obj_12)
   goals met: 0 of 1
7. (op_5 obj_17 obj_15)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_15)
   goals met: 0 of 1
8. (op_5 obj_15 obj_10)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_10)
   goals met: 0 of 1
9. (op_5 obj_10 obj_07)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_07)
   goals met: 0 of 1
10. (op_5 obj_07 obj_18)
   deleted: (pred_11 obj_07)
   added: (pred_11 obj_18)
   goals met: 0 of 1
11. (op_2 obj_18 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_1) (pred_10 obj_12 obj_18)
   goals met: 1 of 1
